yazimma/GH_Terra/SW/STM8L15x-16x-05x-AL31-L_StdPeriph_Lib_V1.6.1/iostm8l152c6.h
#define DMA1_C3SPR_TCIF          DMA1_C3SPR_bit.TCIF
#define DMA1_C3SPR_HTIF          DMA1_C3SPR_bit.HTIF
#define DMA1_C3SPR_TSIZE         DMA1_C3SPR_bit.TSIZE
#define DMA1_C3SPR_PL0           DMA1_C3SPR_bit.PL0
#define DMA1_C3SPR_PL1           DMA1_C3SPR_bit.PL1
#define DMA1_C3SPR_PEND          DMA1_C3SPR_bit.PEND
#define DMA1_C3SPR_BUSY          DMA1_C3SPR_bit.BUSY

#define DMA1_C3NDTR_NDT0         DMA1_C3NDTR_bit.NDT0
#define DMA1_C3NDTR_NDT1         DMA1_C3NDTR_bit.NDT1
#define DMA1_C3NDTR_NDT2         DMA1_C3NDTR_bit.NDT2
#define DMA1_C3NDTR_NDT3         DMA1_C3NDTR_bit.NDT3
#define DMA1_C3NDTR_NDT4         DMA1_C3NDTR_bit.NDT4
#define DMA1_C3NDTR_NDT5         DMA1_C3NDTR_bit.NDT5
#define DMA1_C3NDTR_NDT6         DMA1_C3NDTR_bit.NDT6
#define DMA1_C3NDTR_NDT7         DMA1_C3NDTR_bit.NDT7

#define DMA1_C3PARH_C3M1ARH_PA8  DMA1_C3PARH_C3M1ARH_bit.PA8
#define DMA1_C3PARH_C3M1ARH_M1A8 DMA1_C3PARH_C3M1ARH_bit.M1A8
#define DMA1_C3PARH_C3M1ARH_PA9  DMA1_C3PARH_C3M1ARH_bit.PA9
#define DMA1_C3PARH_C3M1ARH_M1A9 DMA1_C3PARH_C3M1ARH_bit.M1A9
#define DMA1_C3PARH_C3M1ARH_M1A10 DMA1_C3PARH_C3M1ARH_bit.M1A10
#define DMA1_C3PARH_C3M1ARH_PA10 DMA1_C3PARH_C3M1ARH_bit.PA10
#define DMA1_C3PARH_C3M1ARH_M1A11 DMA1_C3PARH_C3M1ARH_bit.M1A11
#define DMA1_C3PARH_C3M1ARH_PA11 DMA1_C3PARH_C3M1ARH_bit.PA11
#define DMA1_C3PARH_C3M1ARH_M1A12 DMA1_C3PARH_C3M1ARH_bit.M1A12
#define DMA1_C3PARH_C3M1ARH_PA12 DMA1_C3PARH_C3M1ARH_bit.PA12
#define DMA1_C3PARH_C3M1ARH_PA13 DMA1_C3PARH_C3M1ARH_bit.PA13
#define DMA1_C3PARH_C3M1ARH_M1A13 DMA1_C3PARH_C3M1ARH_bit.M1A13
#define DMA1_C3PARH_C3M1ARH_PA14 DMA1_C3PARH_C3M1ARH_bit.PA14
#define DMA1_C3PARH_C3M1ARH_M1A14 DMA1_C3PARH_C3M1ARH_bit.M1A14
#define DMA1_C3PARH_C3M1ARH_PA15 DMA1_C3PARH_C3M1ARH_bit.PA15
#define DMA1_C3PARH_C3M1ARH_M1A15 DMA1_C3PARH_C3M1ARH_bit.M1A15

#define DMA1_C3PARL_C3M1ARL_PA0  DMA1_C3PARL_C3M1ARL_bit.PA0
#define DMA1_C3PARL_C3M1ARL_PA1  DMA1_C3PARL_C3M1ARL_bit.PA1
#define DMA1_C3PARL_C3M1ARL_PA2  DMA1_C3PARL_C3M1ARL_bit.PA2
#define DMA1_C3PARL_C3M1ARL_PA3  DMA1_C3PARL_C3M1ARL_bit.PA3
#define DMA1_C3PARL_C3M1ARL_PA4  DMA1_C3PARL_C3M1ARL_bit.PA4
#define DMA1_C3PARL_C3M1ARL_PA5  DMA1_C3PARL_C3M1ARL_bit.PA5
#define DMA1_C3PARL_C3M1ARL_PA6  DMA1_C3PARL_C3M1ARL_bit.PA6
#define DMA1_C3PARL_C3M1ARL_PA7  DMA1_C3PARL_C3M1ARL_bit.PA7

#define DMA1_C3M0ARH_M0A8        DMA1_C3M0ARH_bit.M0A8
#define DMA1_C3M0ARH_M0A9        DMA1_C3M0ARH_bit.M0A9
#define DMA1_C3M0ARH_M0A10       DMA1_C3M0ARH_bit.M0A10
#define DMA1_C3M0ARH_M0A11       DMA1_C3M0ARH_bit.M0A11
#define DMA1_C3M0ARH_M0A12       DMA1_C3M0ARH_bit.M0A12
#define DMA1_C3M0ARH_M0A13       DMA1_C3M0ARH_bit.M0A13
#define DMA1_C3M0ARH_M0A14       DMA1_C3M0ARH_bit.M0A14
#define DMA1_C3M0ARH_M0A15       DMA1_C3M0ARH_bit.M0A15

#define DMA1_C3M0ARL_M0A0        DMA1_C3M0ARL_bit.M0A0
#define DMA1_C3M0ARL_M0A1        DMA1_C3M0ARL_bit.M0A1
#define DMA1_C3M0ARL_M0A2        DMA1_C3M0ARL_bit.M0A2
#define DMA1_C3M0ARL_M0A3        DMA1_C3M0ARL_bit.M0A3
#define DMA1_C3M0ARL_M0A4        DMA1_C3M0ARL_bit.M0A4
#define DMA1_C3M0ARL_M0A5        DMA1_C3M0ARL_bit.M0A5
#define DMA1_C3M0ARL_M0A6        DMA1_C3M0ARL_bit.M0A6
#define DMA1_C3M0ARL_M0A7        DMA1_C3M0ARL_bit.M0A7

#endif

/*-------------------------------------------------------------------------
 *      DMA1 bit masks
 *-----------------------------------------------------------------------*/
#define MASK_DMA1_GCSR_GEN       0x01
#define MASK_DMA1_GCSR_GB        0x02
#define MASK_DMA1_GCSR_TO        0xFC

#define MASK_DMA1_GIR1_IFC0      0x01
#define MASK_DMA1_GIR1_IFC1      0x02
#define MASK_DMA1_GIR1_IFC2      0x04
#define MASK_DMA1_GIR1_IFC3      0x08

#define MASK_DMA1_C0CR_EN        0x01
#define MASK_DMA1_C0CR_TCIE      0x02
#define MASK_DMA1_C0CR_HTIE      0x04
#define MASK_DMA1_C0CR_DIR       0x08
#define MASK_DMA1_C0CR_CIRC      0x10
#define MASK_DMA1_C0CR_MINCDEC   0x20

#define MASK_DMA1_C0SPR_TCIF     0x02
#define MASK_DMA1_C0SPR_HTIF     0x04
#define MASK_DMA1_C0SPR_TSIZE    0x08
#define MASK_DMA1_C0SPR_PL0      0x10
#define MASK_DMA1_C0SPR_PL1      0x20
#define MASK_DMA1_C0SPR_PEND     0x40
#define MASK_DMA1_C0SPR_BUSY     0x80

#define MASK_DMA1_C0NDTR_NDT0    0x01
#define MASK_DMA1_C0NDTR_NDT1    0x02
#define MASK_DMA1_C0NDTR_NDT2    0x04
#define MASK_DMA1_C0NDTR_NDT3    0x08
#define MASK_DMA1_C0NDTR_NDT4    0x10
#define MASK_DMA1_C0NDTR_NDT5    0x20
#define MASK_DMA1_C0NDTR_NDT6    0x40
#define MASK_DMA1_C0NDTR_NDT7    0x80

#define MASK_DMA1_C0PARH_PA8     0x01
#define MASK_DMA1_C0PARH_PA9     0x02
#define MASK_DMA1_C0PARH_PA10    0x04
#define MASK_DMA1_C0PARH_PA11    0x08
#define MASK_DMA1_C0PARH_PA12    0x10
#define MASK_DMA1_C0PARH_PA13    0x20
#define MASK_DMA1_C0PARH_PA14    0x40
#define MASK_DMA1_C0PARH_PA15    0x80

#define MASK_DMA1_C0PARL_PA0     0x01
#define MASK_DMA1_C0PARL_PA1     0x02
#define MASK_DMA1_C0PARL_PA2     0x04
#define MASK_DMA1_C0PARL_PA3     0x08
#define MASK_DMA1_C0PARL_PA4     0x10
#define MASK_DMA1_C0PARL_PA5     0x20
#define MASK_DMA1_C0PARL_PA6     0x40
#define MASK_DMA1_C0PARL_PA7     0x80

#define MASK_DMA1_C0M0ARH_M0A8   0x01
#define MASK_DMA1_C0M0ARH_M0A9   0x02
#define MASK_DMA1_C0M0ARH_M0A10  0x04
#define MASK_DMA1_C0M0ARH_M0A11  0x08
#define MASK_DMA1_C0M0ARH_M0A12  0x10
#define MASK_DMA1_C0M0ARH_M0A13  0x20
#define MASK_DMA1_C0M0ARH_M0A14  0x40
#define MASK_DMA1_C0M0ARH_M0A15  0x80

#define MASK_DMA1_C0M0ARL_M0A0   0x01
#define MASK_DMA1_C0M0ARL_M0A1   0x02
#define MASK_DMA1_C0M0ARL_M0A2   0x04
#define MASK_DMA1_C0M0ARL_M0A3   0x08
#define MASK_DMA1_C0M0ARL_M0A4   0x10
#define MASK_DMA1_C0M0ARL_M0A5   0x20
#define MASK_DMA1_C0M0ARL_M0A6   0x40
#define MASK_DMA1_C0M0ARL_M0A7   0x80

#define MASK_DMA1_C1CR_EN        0x01
#define MASK_DMA1_C1CR_TCIE      0x02
#define MASK_DMA1_C1CR_HTIE      0x04
#define MASK_DMA1_C1CR_DIR       0x08
#define MASK_DMA1_C1CR_CIRC      0x10
#define MASK_DMA1_C1CR_MINCDEC   0x20

#define MASK_DMA1_C1SPR_TCIF     0x02
#define MASK_DMA1_C1SPR_HTIF     0x04
#define MASK_DMA1_C1SPR_TSIZE    0x08
#define MASK_DMA1_C1SPR_PL0      0x10
#define MASK_DMA1_C1SPR_PL1      0x20
#define MASK_DMA1_C1SPR_PEND     0x40
#define MASK_DMA1_C1SPR_BUSY     0x80

#define MASK_DMA1_C1NDTR_NDT0    0x01
#define MASK_DMA1_C1NDTR_NDT1    0x02
#define MASK_DMA1_C1NDTR_NDT2    0x04
#define MASK_DMA1_C1NDTR_NDT3    0x08
#define MASK_DMA1_C1NDTR_NDT4    0x10
#define MASK_DMA1_C1NDTR_NDT5    0x20
#define MASK_DMA1_C1NDTR_NDT6    0x40
#define MASK_DMA1_C1NDTR_NDT7    0x80

