yazimma/GH_Terra/SW/STM8L15x-16x-05x-AL31-L_StdPeriph_Lib_V1.6.1/iostm8l152c6.h
#define MASK_DMA1_C1PARH_PA8     0x01
#define MASK_DMA1_C1PARH_PA9     0x02
#define MASK_DMA1_C1PARH_PA10    0x04
#define MASK_DMA1_C1PARH_PA11    0x08
#define MASK_DMA1_C1PARH_PA12    0x10
#define MASK_DMA1_C1PARH_PA13    0x20
#define MASK_DMA1_C1PARH_PA14    0x40
#define MASK_DMA1_C1PARH_PA15    0x80

#define MASK_DMA1_C1PARL_PA0     0x01
#define MASK_DMA1_C1PARL_PA1     0x02
#define MASK_DMA1_C1PARL_PA2     0x04
#define MASK_DMA1_C1PARL_PA3     0x08
#define MASK_DMA1_C1PARL_PA4     0x10
#define MASK_DMA1_C1PARL_PA5     0x20
#define MASK_DMA1_C1PARL_PA6     0x40
#define MASK_DMA1_C1PARL_PA7     0x80

#define MASK_DMA1_C1M0ARH_M0A8   0x01
#define MASK_DMA1_C1M0ARH_M0A9   0x02
#define MASK_DMA1_C1M0ARH_M0A10  0x04
#define MASK_DMA1_C1M0ARH_M0A11  0x08
#define MASK_DMA1_C1M0ARH_M0A12  0x10
#define MASK_DMA1_C1M0ARH_M0A13  0x20
#define MASK_DMA1_C1M0ARH_M0A14  0x40
#define MASK_DMA1_C1M0ARH_M0A15  0x80

#define MASK_DMA1_C1M0ARL_M0A0   0x01
#define MASK_DMA1_C1M0ARL_M0A1   0x02
#define MASK_DMA1_C1M0ARL_M0A2   0x04
#define MASK_DMA1_C1M0ARL_M0A3   0x08
#define MASK_DMA1_C1M0ARL_M0A4   0x10
#define MASK_DMA1_C1M0ARL_M0A5   0x20
#define MASK_DMA1_C1M0ARL_M0A6   0x40
#define MASK_DMA1_C1M0ARL_M0A7   0x80

#define MASK_DMA1_C2CR_EN        0x01
#define MASK_DMA1_C2CR_TCIE      0x02
#define MASK_DMA1_C2CR_HTIE      0x04
#define MASK_DMA1_C2CR_DIR       0x08
#define MASK_DMA1_C2CR_CIRC      0x10
#define MASK_DMA1_C2CR_MINCDEC   0x20

#define MASK_DMA1_C2SPR_TCIF     0x02
#define MASK_DMA1_C2SPR_HTIF     0x04
#define MASK_DMA1_C2SPR_TSIZE    0x08
#define MASK_DMA1_C2SPR_PL0      0x10
#define MASK_DMA1_C2SPR_PL1      0x20
#define MASK_DMA1_C2SPR_PEND     0x40
#define MASK_DMA1_C2SPR_BUSY     0x80

#define MASK_DMA1_C2NDTR_NDT0    0x01
#define MASK_DMA1_C2NDTR_NDT1    0x02
#define MASK_DMA1_C2NDTR_NDT2    0x04
#define MASK_DMA1_C2NDTR_NDT3    0x08
#define MASK_DMA1_C2NDTR_NDT4    0x10
#define MASK_DMA1_C2NDTR_NDT5    0x20
#define MASK_DMA1_C2NDTR_NDT6    0x40
#define MASK_DMA1_C2NDTR_NDT7    0x80

#define MASK_DMA1_C2PARH_PA8     0x01
#define MASK_DMA1_C2PARH_PA9     0x02
#define MASK_DMA1_C2PARH_PA10    0x04
#define MASK_DMA1_C2PARH_PA11    0x08
#define MASK_DMA1_C2PARH_PA12    0x10
#define MASK_DMA1_C2PARH_PA13    0x20
#define MASK_DMA1_C2PARH_PA14    0x40
#define MASK_DMA1_C2PARH_PA15    0x80

#define MASK_DMA1_C2PARL_PA0     0x01
#define MASK_DMA1_C2PARL_PA1     0x02
#define MASK_DMA1_C2PARL_PA2     0x04
#define MASK_DMA1_C2PARL_PA3     0x08
#define MASK_DMA1_C2PARL_PA4     0x10
#define MASK_DMA1_C2PARL_PA5     0x20
#define MASK_DMA1_C2PARL_PA6     0x40
#define MASK_DMA1_C2PARL_PA7     0x80

#define MASK_DMA1_C2M0ARH_M0A8   0x01
#define MASK_DMA1_C2M0ARH_M0A9   0x02
#define MASK_DMA1_C2M0ARH_M0A10  0x04
#define MASK_DMA1_C2M0ARH_M0A11  0x08
#define MASK_DMA1_C2M0ARH_M0A12  0x10
#define MASK_DMA1_C2M0ARH_M0A13  0x20
#define MASK_DMA1_C2M0ARH_M0A14  0x40
#define MASK_DMA1_C2M0ARH_M0A15  0x80

#define MASK_DMA1_C2M0ARL_M0A0   0x01
#define MASK_DMA1_C2M0ARL_M0A1   0x02
#define MASK_DMA1_C2M0ARL_M0A2   0x04
#define MASK_DMA1_C2M0ARL_M0A3   0x08
#define MASK_DMA1_C2M0ARL_M0A4   0x10
#define MASK_DMA1_C2M0ARL_M0A5   0x20
#define MASK_DMA1_C2M0ARL_M0A6   0x40
#define MASK_DMA1_C2M0ARL_M0A7   0x80

#define MASK_DMA1_C3CR_EN        0x01
#define MASK_DMA1_C3CR_TCIE      0x02
#define MASK_DMA1_C3CR_HTIE      0x04
#define MASK_DMA1_C3CR_DIR       0x08
#define MASK_DMA1_C3CR_CIRC      0x10
#define MASK_DMA1_C3CR_MINCDEC   0x20
#define MASK_DMA1_C3CR_MEM       0x40

#define MASK_DMA1_C3SPR_TCIF     0x02
#define MASK_DMA1_C3SPR_HTIF     0x04
#define MASK_DMA1_C3SPR_TSIZE    0x08
#define MASK_DMA1_C3SPR_PL0      0x10
#define MASK_DMA1_C3SPR_PL1      0x20
#define MASK_DMA1_C3SPR_PEND     0x40
#define MASK_DMA1_C3SPR_BUSY     0x80

#define MASK_DMA1_C3NDTR_NDT0    0x01
#define MASK_DMA1_C3NDTR_NDT1    0x02
#define MASK_DMA1_C3NDTR_NDT2    0x04
#define MASK_DMA1_C3NDTR_NDT3    0x08
#define MASK_DMA1_C3NDTR_NDT4    0x10
#define MASK_DMA1_C3NDTR_NDT5    0x20
#define MASK_DMA1_C3NDTR_NDT6    0x40
#define MASK_DMA1_C3NDTR_NDT7    0x80

#define MASK_DMA1_C3PARH_C3M1ARH_PA8 0x01
#define MASK_DMA1_C3PARH_C3M1ARH_M1A8 0x01
#define MASK_DMA1_C3PARH_C3M1ARH_PA9 0x02
#define MASK_DMA1_C3PARH_C3M1ARH_M1A9 0x02
#define MASK_DMA1_C3PARH_C3M1ARH_M1A10 0x04
#define MASK_DMA1_C3PARH_C3M1ARH_PA10 0x04
#define MASK_DMA1_C3PARH_C3M1ARH_M1A11 0x08
#define MASK_DMA1_C3PARH_C3M1ARH_PA11 0x08
#define MASK_DMA1_C3PARH_C3M1ARH_M1A12 0x10
#define MASK_DMA1_C3PARH_C3M1ARH_PA12 0x10
#define MASK_DMA1_C3PARH_C3M1ARH_PA13 0x20
#define MASK_DMA1_C3PARH_C3M1ARH_M1A13 0x20
#define MASK_DMA1_C3PARH_C3M1ARH_PA14 0x40
#define MASK_DMA1_C3PARH_C3M1ARH_M1A14 0x40
#define MASK_DMA1_C3PARH_C3M1ARH_PA15 0x80
#define MASK_DMA1_C3PARH_C3M1ARH_M1A15 0x80

#define MASK_DMA1_C3PARL_C3M1ARL_PA0 0x01
#define MASK_DMA1_C3PARL_C3M1ARL_PA1 0x02
#define MASK_DMA1_C3PARL_C3M1ARL_PA2 0x04
#define MASK_DMA1_C3PARL_C3M1ARL_PA3 0x08
#define MASK_DMA1_C3PARL_C3M1ARL_PA4 0x10
#define MASK_DMA1_C3PARL_C3M1ARL_PA5 0x20
#define MASK_DMA1_C3PARL_C3M1ARL_PA6 0x40
#define MASK_DMA1_C3PARL_C3M1ARL_PA7 0x80

#define MASK_DMA1_C3M0ARH_M0A8   0x01
#define MASK_DMA1_C3M0ARH_M0A9   0x02
#define MASK_DMA1_C3M0ARH_M0A10  0x04
#define MASK_DMA1_C3M0ARH_M0A11  0x08
#define MASK_DMA1_C3M0ARH_M0A12  0x10
#define MASK_DMA1_C3M0ARH_M0A13  0x20
#define MASK_DMA1_C3M0ARH_M0A14  0x40
#define MASK_DMA1_C3M0ARH_M0A15  0x80

#define MASK_DMA1_C3M0ARL_M0A0   0x01
#define MASK_DMA1_C3M0ARL_M0A1   0x02
#define MASK_DMA1_C3M0ARL_M0A2   0x04
#define MASK_DMA1_C3M0ARL_M0A3   0x08
#define MASK_DMA1_C3M0ARL_M0A4   0x10
#define MASK_DMA1_C3M0ARL_M0A5   0x20
#define MASK_DMA1_C3M0ARL_M0A6   0x40
#define MASK_DMA1_C3M0ARL_M0A7   0x80


/*-------------------------------------------------------------------------
 *      REMAP register definitions
 *-----------------------------------------------------------------------*/
/* Remapping register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ADC1DMA_REMAP: 2;
  unsigned char TIM4DMA_REMAP: 2;
  unsigned char USART1TR_REMAP: 2;
  unsigned char USART1CK_REMAP: 1;
  unsigned char SPI1_REMAP  : 1;
} __BITS_SYSCFG_RMPCR1;
#endif
__IO_REG8_BIT(SYSCFG_RMPCR1, 0x509E, __READ_WRITE, __BITS_SYSCFG_RMPCR1);

/* Remapping register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ADC1TRIG_REMAP: 1;
  unsigned char TIM2TRIG_REMAP: 1;
  unsigned char TIM3TRIG_REMAP: 1;
} __BITS_SYSCFG_RMPCR2;
#endif
__IO_REG8_BIT(SYSCFG_RMPCR2, 0x509F, __READ_WRITE, __BITS_SYSCFG_RMPCR2);


/*-------------------------------------------------------------------------
 *      REMAP bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define SYSCFG_RMPCR1_ADC1DMA_REMAP SYSCFG_RMPCR1_bit.ADC1DMA_REMAP
#define SYSCFG_RMPCR1_TIM4DMA_REMAP SYSCFG_RMPCR1_bit.TIM4DMA_REMAP
#define SYSCFG_RMPCR1_USART1TR_REMAP SYSCFG_RMPCR1_bit.USART1TR_REMAP
#define SYSCFG_RMPCR1_USART1CK_REMAP SYSCFG_RMPCR1_bit.USART1CK_REMAP
#define SYSCFG_RMPCR1_SPI1_REMAP SYSCFG_RMPCR1_bit.SPI1_REMAP

#define SYSCFG_RMPCR2_ADC1TRIG_REMAP SYSCFG_RMPCR2_bit.ADC1TRIG_REMAP
#define SYSCFG_RMPCR2_TIM2TRIG_REMAP SYSCFG_RMPCR2_bit.TIM2TRIG_REMAP
#define SYSCFG_RMPCR2_TIM3TRIG_REMAP SYSCFG_RMPCR2_bit.TIM3TRIG_REMAP

#endif

/*-------------------------------------------------------------------------
 *      REMAP bit masks
 *-----------------------------------------------------------------------*/
#define MASK_SYSCFG_RMPCR1_ADC1DMA_REMAP 0x03
#define MASK_SYSCFG_RMPCR1_TIM4DMA_REMAP 0x0C
#define MASK_SYSCFG_RMPCR1_USART1TR_REMAP 0x30
#define MASK_SYSCFG_RMPCR1_USART1CK_REMAP 0x40
#define MASK_SYSCFG_RMPCR1_SPI1_REMAP 0x80

#define MASK_SYSCFG_RMPCR2_ADC1TRIG_REMAP 0x01
#define MASK_SYSCFG_RMPCR2_TIM2TRIG_REMAP 0x02
#define MASK_SYSCFG_RMPCR2_TIM3TRIG_REMAP 0x04


/*-------------------------------------------------------------------------
 *      ITC - EXTI register definitions
 *-----------------------------------------------------------------------*/
/* External interrupt control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char P0IS        : 2;
  unsigned char P1IS        : 2;
  unsigned char P2IS        : 2;
  unsigned char P3IS        : 2;
} __BITS_EXTI_CR1;
#endif
__IO_REG8_BIT(EXTI_CR1,    0x50A0, __READ_WRITE, __BITS_EXTI_CR1);

/* External interrupt control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char P4IS        : 2;
  unsigned char P5IS        : 2;
  unsigned char P6IS        : 2;
  unsigned char P7IS        : 2;
} __BITS_EXTI_CR2;
#endif
__IO_REG8_BIT(EXTI_CR2,    0x50A1, __READ_WRITE, __BITS_EXTI_CR2);

/* External interrupt control register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PBIS        : 2;
  unsigned char PDIS        : 2;
  unsigned char PEIS        : 2;
  unsigned char PFIS        : 2;
} __BITS_EXTI_CR3;
#endif
__IO_REG8_BIT(EXTI_CR3,    0x50A2, __READ_WRITE, __BITS_EXTI_CR3);

/* External interrupt status register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char P0F         : 1;
  unsigned char P1F         : 1;
  unsigned char P2F         : 1;
  unsigned char P3F         : 1;
  unsigned char P4F         : 1;
  unsigned char P5F         : 1;
  unsigned char P6F         : 1;
  unsigned char P7F         : 1;
} __BITS_EXTI_SR1;
#endif
__IO_REG8_BIT(EXTI_SR1,    0x50A3, __READ_WRITE, __BITS_EXTI_SR1);

