yazimma/GH_Terra/SW/STM8L15x-16x-05x-AL31-L_StdPeriph_Lib_V1.6.1/iostm8l152c6.h
/* Peripheral clock gating register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PCKEN10     : 1;
  unsigned char PCKEN11     : 1;
  unsigned char PCKEN12     : 1;
  unsigned char PCKEN13     : 1;
  unsigned char PCKEN14     : 1;
  unsigned char PCKEN15     : 1;
  unsigned char PCKEN16     : 1;
  unsigned char PCKEN17     : 1;
} __BITS_CLK_PCKENR1;
#endif
__IO_REG8_BIT(CLK_PCKENR1, 0x50C3, __READ_WRITE, __BITS_CLK_PCKENR1);

/* Peripheral clock gating register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PCKEN20     : 1;
  unsigned char PCKEN21     : 1;
  unsigned char PCKEN22     : 1;
  unsigned char PCKEN23     : 1;
  unsigned char PCKEN24     : 1;
  unsigned char PCKEN25     : 1;
  unsigned char             : 1;
  unsigned char PCKEN27     : 1;
} __BITS_CLK_PCKENR2;
#endif
__IO_REG8_BIT(CLK_PCKENR2, 0x50C4, __READ_WRITE, __BITS_CLK_PCKENR2);

/* Configurable clock control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCOSWBSY    : 1;
  unsigned char CCOSEL      : 4;
  unsigned char CCODIV      : 3;
} __BITS_CLK_CCOR;
#endif
__IO_REG8_BIT(CLK_CCOR,    0x50C5, __READ_WRITE, __BITS_CLK_CCOR);

/* External clock control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char HSEON       : 1;
  unsigned char HSERDY      : 1;
  unsigned char LSEON       : 1;
  unsigned char LSERDY      : 1;
  unsigned char HSEBYP      : 1;
  unsigned char LSEBYP      : 1;
} __BITS_CLK_ECKR;
#endif
__IO_REG8_BIT(CLK_ECKR,    0x50C6, __READ_WRITE, __BITS_CLK_ECKR);

/* Clock master status register */
__IO_REG8    (CLK_SCSR,    0x50C7, __READ_WRITE);
/* Clock master switch register */
__IO_REG8    (CLK_SWR,     0x50C8, __READ_WRITE);
/* Clock switch control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SWBSY       : 1;
  unsigned char SWEN        : 1;
  unsigned char SWIEN       : 1;
  unsigned char SWIF        : 1;
} __BITS_CLK_SWCR;
#endif
__IO_REG8_BIT(CLK_SWCR,    0x50C9, __READ_WRITE, __BITS_CLK_SWCR);

/* Clock security system register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CSSEN       : 1;
  unsigned char AUX         : 1;
  unsigned char CSSDIE      : 1;
  unsigned char CSSD        : 1;
  unsigned char CSSDGON     : 1;
} __BITS_CLK_CSSR;
#endif
__IO_REG8_BIT(CLK_CSSR,    0x50CA, __READ_WRITE, __BITS_CLK_CSSR);

/* Clock BEEP register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char BEEPSWBSY   : 1;
  unsigned char CLKBEEPSEL0 : 1;
  unsigned char CLKBEEPSEL1 : 1;
} __BITS_CLK_CBEEPR;
#endif
__IO_REG8_BIT(CLK_CBEEPR,  0x50CB, __READ_WRITE, __BITS_CLK_CBEEPR);

/* HSI calibration register */
__IO_REG8    (CLK_HSICALR, 0x50CC, __READ);
/* HSI clock calibration trimming register */
__IO_REG8    (CLK_HSITRIMR, 0x50CD, __READ_WRITE);
/* HSI unlock register */
__IO_REG8    (CLK_HSIUNLCKR, 0x50CE, __READ_WRITE);
/* Main regulator control status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char REGREADY    : 1;
  unsigned char REGOFF      : 1;
  unsigned char HSIPD       : 1;
  unsigned char LSIPD       : 1;
  unsigned char HSEPD       : 1;
  unsigned char LSEPD       : 1;
  unsigned char EEBUSY      : 1;
  unsigned char EEREADY     : 1;
} __BITS_CLK_REGCSR;
#endif
__IO_REG8_BIT(CLK_REGCSR,  0x50CF, __READ_WRITE, __BITS_CLK_REGCSR);


/*-------------------------------------------------------------------------
 *      CLK bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define CLK_CKDIVR_CKM           CLK_CKDIVR_bit.CKM

#define CLK_CRTCR_RTCSWBSY       CLK_CRTCR_bit.RTCSWBSY
#define CLK_CRTCR_RTCSEL0        CLK_CRTCR_bit.RTCSEL0
#define CLK_CRTCR_RTCSEL1        CLK_CRTCR_bit.RTCSEL1
#define CLK_CRTCR_RTCSEL2        CLK_CRTCR_bit.RTCSEL2
#define CLK_CRTCR_RTCSEL3        CLK_CRTCR_bit.RTCSEL3
#define CLK_CRTCR_RTCDIV0        CLK_CRTCR_bit.RTCDIV0
#define CLK_CRTCR_RTCDIV1        CLK_CRTCR_bit.RTCDIV1
#define CLK_CRTCR_RTCDIV2        CLK_CRTCR_bit.RTCDIV2

#define CLK_ICKCR_HSION          CLK_ICKCR_bit.HSION
#define CLK_ICKCR_HSIRDY         CLK_ICKCR_bit.HSIRDY
#define CLK_ICKCR_LSION          CLK_ICKCR_bit.LSION
#define CLK_ICKCR_LSIRDY         CLK_ICKCR_bit.LSIRDY
#define CLK_ICKCR_SAHALT         CLK_ICKCR_bit.SAHALT
#define CLK_ICKCR_FHWU           CLK_ICKCR_bit.FHWU
#define CLK_ICKCR_BEEPAHALT      CLK_ICKCR_bit.BEEPAHALT

#define CLK_PCKENR1_PCKEN10      CLK_PCKENR1_bit.PCKEN10
#define CLK_PCKENR1_PCKEN11      CLK_PCKENR1_bit.PCKEN11
#define CLK_PCKENR1_PCKEN12      CLK_PCKENR1_bit.PCKEN12
#define CLK_PCKENR1_PCKEN13      CLK_PCKENR1_bit.PCKEN13
#define CLK_PCKENR1_PCKEN14      CLK_PCKENR1_bit.PCKEN14
#define CLK_PCKENR1_PCKEN15      CLK_PCKENR1_bit.PCKEN15
#define CLK_PCKENR1_PCKEN16      CLK_PCKENR1_bit.PCKEN16
#define CLK_PCKENR1_PCKEN17      CLK_PCKENR1_bit.PCKEN17

#define CLK_PCKENR2_PCKEN20      CLK_PCKENR2_bit.PCKEN20
#define CLK_PCKENR2_PCKEN21      CLK_PCKENR2_bit.PCKEN21
#define CLK_PCKENR2_PCKEN22      CLK_PCKENR2_bit.PCKEN22
#define CLK_PCKENR2_PCKEN23      CLK_PCKENR2_bit.PCKEN23
#define CLK_PCKENR2_PCKEN24      CLK_PCKENR2_bit.PCKEN24
#define CLK_PCKENR2_PCKEN25      CLK_PCKENR2_bit.PCKEN25
#define CLK_PCKENR2_PCKEN27      CLK_PCKENR2_bit.PCKEN27

#define CLK_CCOR_CCOSWBSY        CLK_CCOR_bit.CCOSWBSY
#define CLK_CCOR_CCOSEL          CLK_CCOR_bit.CCOSEL
#define CLK_CCOR_CCODIV          CLK_CCOR_bit.CCODIV

#define CLK_ECKR_HSEON           CLK_ECKR_bit.HSEON
#define CLK_ECKR_HSERDY          CLK_ECKR_bit.HSERDY
#define CLK_ECKR_LSEON           CLK_ECKR_bit.LSEON
#define CLK_ECKR_LSERDY          CLK_ECKR_bit.LSERDY
#define CLK_ECKR_HSEBYP          CLK_ECKR_bit.HSEBYP
#define CLK_ECKR_LSEBYP          CLK_ECKR_bit.LSEBYP

#define CLK_SWCR_SWBSY           CLK_SWCR_bit.SWBSY
#define CLK_SWCR_SWEN            CLK_SWCR_bit.SWEN
#define CLK_SWCR_SWIEN           CLK_SWCR_bit.SWIEN
#define CLK_SWCR_SWIF            CLK_SWCR_bit.SWIF

#define CLK_CSSR_CSSEN           CLK_CSSR_bit.CSSEN
#define CLK_CSSR_AUX             CLK_CSSR_bit.AUX
#define CLK_CSSR_CSSDIE          CLK_CSSR_bit.CSSDIE
#define CLK_CSSR_CSSD            CLK_CSSR_bit.CSSD
#define CLK_CSSR_CSSDGON         CLK_CSSR_bit.CSSDGON

#define CLK_CBEEPR_BEEPSWBSY     CLK_CBEEPR_bit.BEEPSWBSY
#define CLK_CBEEPR_CLKBEEPSEL0   CLK_CBEEPR_bit.CLKBEEPSEL0
#define CLK_CBEEPR_CLKBEEPSEL1   CLK_CBEEPR_bit.CLKBEEPSEL1

#define CLK_REGCSR_REGREADY      CLK_REGCSR_bit.REGREADY
#define CLK_REGCSR_REGOFF        CLK_REGCSR_bit.REGOFF
#define CLK_REGCSR_HSIPD         CLK_REGCSR_bit.HSIPD
#define CLK_REGCSR_LSIPD         CLK_REGCSR_bit.LSIPD
#define CLK_REGCSR_HSEPD         CLK_REGCSR_bit.HSEPD
#define CLK_REGCSR_LSEPD         CLK_REGCSR_bit.LSEPD
#define CLK_REGCSR_EEBUSY        CLK_REGCSR_bit.EEBUSY
#define CLK_REGCSR_EEREADY       CLK_REGCSR_bit.EEREADY

#endif

/*-------------------------------------------------------------------------
 *      CLK bit masks
 *-----------------------------------------------------------------------*/
#define MASK_CLK_CKDIVR_CKM      0x07

#define MASK_CLK_CRTCR_RTCSWBSY  0x01
#define MASK_CLK_CRTCR_RTCSEL0   0x02
#define MASK_CLK_CRTCR_RTCSEL1   0x04
#define MASK_CLK_CRTCR_RTCSEL2   0x08
#define MASK_CLK_CRTCR_RTCSEL3   0x10
#define MASK_CLK_CRTCR_RTCDIV0   0x20
#define MASK_CLK_CRTCR_RTCDIV1   0x40
#define MASK_CLK_CRTCR_RTCDIV2   0x80

#define MASK_CLK_ICKCR_HSION     0x01
#define MASK_CLK_ICKCR_HSIRDY    0x02
#define MASK_CLK_ICKCR_LSION     0x04
#define MASK_CLK_ICKCR_LSIRDY    0x08
#define MASK_CLK_ICKCR_SAHALT    0x10
#define MASK_CLK_ICKCR_FHWU      0x20
#define MASK_CLK_ICKCR_BEEPAHALT 0x40

#define MASK_CLK_PCKENR1_PCKEN10 0x01
#define MASK_CLK_PCKENR1_PCKEN11 0x02
#define MASK_CLK_PCKENR1_PCKEN12 0x04
#define MASK_CLK_PCKENR1_PCKEN13 0x08
#define MASK_CLK_PCKENR1_PCKEN14 0x10
#define MASK_CLK_PCKENR1_PCKEN15 0x20
#define MASK_CLK_PCKENR1_PCKEN16 0x40
#define MASK_CLK_PCKENR1_PCKEN17 0x80

#define MASK_CLK_PCKENR2_PCKEN20 0x01
#define MASK_CLK_PCKENR2_PCKEN21 0x02
#define MASK_CLK_PCKENR2_PCKEN22 0x04
#define MASK_CLK_PCKENR2_PCKEN23 0x08
#define MASK_CLK_PCKENR2_PCKEN24 0x10
#define MASK_CLK_PCKENR2_PCKEN25 0x20
#define MASK_CLK_PCKENR2_PCKEN27 0x80

#define MASK_CLK_CCOR_CCOSWBSY   0x01
#define MASK_CLK_CCOR_CCOSEL     0x1E
#define MASK_CLK_CCOR_CCODIV     0xE0

#define MASK_CLK_ECKR_HSEON      0x01
#define MASK_CLK_ECKR_HSERDY     0x02
#define MASK_CLK_ECKR_LSEON      0x04
#define MASK_CLK_ECKR_LSERDY     0x08
#define MASK_CLK_ECKR_HSEBYP     0x10
#define MASK_CLK_ECKR_LSEBYP     0x20

