yazimma/GH_Terra/SW/STM8L15x-16x-05x-AL31-L_StdPeriph_Lib_V1.6.1/iostm8l152c6.h
#define MASK_TIM1_CCR2L_CCR20    0x01
#define MASK_TIM1_CCR2L_CCR21    0x02
#define MASK_TIM1_CCR2L_CCR22    0x04
#define MASK_TIM1_CCR2L_CCR23    0x08
#define MASK_TIM1_CCR2L_CCR24    0x10
#define MASK_TIM1_CCR2L_CCR25    0x20
#define MASK_TIM1_CCR2L_CCR26    0x40
#define MASK_TIM1_CCR2L_CCR27    0x80

#define MASK_TIM1_CCR3H_CCR38    0x01
#define MASK_TIM1_CCR3H_CCR39    0x02
#define MASK_TIM1_CCR3H_CCR310   0x04
#define MASK_TIM1_CCR3H_CCR311   0x08
#define MASK_TIM1_CCR3H_CCR312   0x10
#define MASK_TIM1_CCR3H_CCR313   0x20
#define MASK_TIM1_CCR3H_CCR314   0x40
#define MASK_TIM1_CCR3H_CCR315   0x80

#define MASK_TIM1_CCR3L_CCR30    0x01
#define MASK_TIM1_CCR3L_CCR31    0x02
#define MASK_TIM1_CCR3L_CCR32    0x04
#define MASK_TIM1_CCR3L_CCR33    0x08
#define MASK_TIM1_CCR3L_CCR34    0x10
#define MASK_TIM1_CCR3L_CCR35    0x20
#define MASK_TIM1_CCR3L_CCR36    0x40
#define MASK_TIM1_CCR3L_CCR37    0x80

#define MASK_TIM1_CCR4H_CCR48    0x01
#define MASK_TIM1_CCR4H_CCR49    0x02
#define MASK_TIM1_CCR4H_CCR410   0x04
#define MASK_TIM1_CCR4H_CCR411   0x08
#define MASK_TIM1_CCR4H_CCR412   0x10
#define MASK_TIM1_CCR4H_CCR413   0x20
#define MASK_TIM1_CCR4H_CCR414   0x40
#define MASK_TIM1_CCR4H_CCR415   0x80

#define MASK_TIM1_CCR4L_CCR40    0x01
#define MASK_TIM1_CCR4L_CCR41    0x02
#define MASK_TIM1_CCR4L_CCR42    0x04
#define MASK_TIM1_CCR4L_CCR43    0x08
#define MASK_TIM1_CCR4L_CCR44    0x10
#define MASK_TIM1_CCR4L_CCR45    0x20
#define MASK_TIM1_CCR4L_CCR46    0x40
#define MASK_TIM1_CCR4L_CCR47    0x80

#define MASK_TIM1_BKR_LOCK       0x03
#define MASK_TIM1_BKR_OSSI       0x04
#define MASK_TIM1_BKR_OSSR       0x08
#define MASK_TIM1_BKR_BKE        0x10
#define MASK_TIM1_BKR_BKP        0x20
#define MASK_TIM1_BKR_AOE        0x40
#define MASK_TIM1_BKR_MOE        0x80

#define MASK_TIM1_OISR_OIS1      0x01
#define MASK_TIM1_OISR_OIS1N     0x02
#define MASK_TIM1_OISR_OIS2      0x04
#define MASK_TIM1_OISR_OIS2N     0x08
#define MASK_TIM1_OISR_OIS3      0x10
#define MASK_TIM1_OISR_OIS3N     0x20

#define MASK_TIM1_DCR1_DBA       0x1F

#define MASK_TIM1_DCR2_DBL       0x1F


/*-------------------------------------------------------------------------
 *      TIM4 register definitions
 *-----------------------------------------------------------------------*/
/* TIM4 control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CEN         : 1;
  unsigned char UDIS        : 1;
  unsigned char URS         : 1;
  unsigned char OPM         : 1;
  unsigned char             : 3;
  unsigned char ARPE        : 1;
} __BITS_TIM4_CR1;
#endif
__IO_REG8_BIT(TIM4_CR1,    0x52E0, __READ_WRITE, __BITS_TIM4_CR1);

/* TIM4 control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 4;
  unsigned char MMS         : 3;
} __BITS_TIM4_CR2;
#endif
__IO_REG8_BIT(TIM4_CR2,    0x52E1, __READ_WRITE, __BITS_TIM4_CR2);

/* TIM4 Slave mode control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SMS         : 3;
  unsigned char             : 1;
  unsigned char TS          : 3;
  unsigned char MSM         : 1;
} __BITS_TIM4_SMCR;
#endif
__IO_REG8_BIT(TIM4_SMCR,   0x52E2, __READ_WRITE, __BITS_TIM4_SMCR);

/* TIM4 DMA1 request enable register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UDE         : 1;
} __BITS_TIM4_DER;
#endif
__IO_REG8_BIT(TIM4_DER,    0x52E3, __READ_WRITE, __BITS_TIM4_DER);

/* TIM4 Interrupt enable register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UIE         : 1;
  unsigned char             : 5;
  unsigned char TIE         : 1;
} __BITS_TIM4_IER;
#endif
__IO_REG8_BIT(TIM4_IER,    0x52E4, __READ_WRITE, __BITS_TIM4_IER);

/* TIM4 status register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UIF         : 1;
  unsigned char             : 5;
  unsigned char TIF         : 1;
} __BITS_TIM4_SR1;
#endif
__IO_REG8_BIT(TIM4_SR1,    0x52E5, __READ_WRITE, __BITS_TIM4_SR1);

/* TIM4 Event generation register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UG          : 1;
  unsigned char             : 5;
  unsigned char TG          : 1;
} __BITS_TIM4_EGR;
#endif
__IO_REG8_BIT(TIM4_EGR,    0x52E6, __WRITE, __BITS_TIM4_EGR);

/* TIM4 counter */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CNT0        : 1;
  unsigned char CNT1        : 1;
  unsigned char CNT2        : 1;
  unsigned char CNT3        : 1;
  unsigned char CNT4        : 1;
  unsigned char CNT5        : 1;
  unsigned char CNT6        : 1;
  unsigned char CNT7        : 1;
} __BITS_TIM4_CNTR;
#endif
__IO_REG8_BIT(TIM4_CNTR,   0x52E7, __READ_WRITE, __BITS_TIM4_CNTR);

/* TIM4 prescaler register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PSC         : 4;
} __BITS_TIM4_PSCR;
#endif
__IO_REG8_BIT(TIM4_PSCR,   0x52E8, __READ_WRITE, __BITS_TIM4_PSCR);

/* TIM4 Auto-reload register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ARR0        : 1;
  unsigned char ARR1        : 1;
  unsigned char ARR2        : 1;
  unsigned char ARR3        : 1;
  unsigned char ARR4        : 1;
  unsigned char ARR5        : 1;
  unsigned char ARR6        : 1;
  unsigned char ARR7        : 1;
} __BITS_TIM4_ARR;
#endif
__IO_REG8_BIT(TIM4_ARR,    0x52E9, __READ_WRITE, __BITS_TIM4_ARR);


/*-------------------------------------------------------------------------
 *      TIM4 bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define TIM4_CR1_CEN             TIM4_CR1_bit.CEN
#define TIM4_CR1_UDIS            TIM4_CR1_bit.UDIS
#define TIM4_CR1_URS             TIM4_CR1_bit.URS
#define TIM4_CR1_OPM             TIM4_CR1_bit.OPM
#define TIM4_CR1_ARPE            TIM4_CR1_bit.ARPE

#define TIM4_CR2_MMS             TIM4_CR2_bit.MMS

#define TIM4_SMCR_SMS            TIM4_SMCR_bit.SMS
#define TIM4_SMCR_TS             TIM4_SMCR_bit.TS
#define TIM4_SMCR_MSM            TIM4_SMCR_bit.MSM

#define TIM4_DER_UDE             TIM4_DER_bit.UDE

#define TIM4_IER_UIE             TIM4_IER_bit.UIE
#define TIM4_IER_TIE             TIM4_IER_bit.TIE

