yazimma/GH_Terra/SW/STM8L15x-16x-05x-AL31-L_StdPeriph_Lib_V1.6.1/iostm8l152c6.h
#define MASK_DAC_DORH_DORH       0x0F


/*-------------------------------------------------------------------------
 *      LCD register definitions
 *-----------------------------------------------------------------------*/
/* LCD control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char B2          : 1;
  unsigned char DUTY0       : 1;
  unsigned char DUTY1       : 1;
  unsigned char BLINKF0     : 1;
  unsigned char BLINKF1     : 1;
  unsigned char BLINKF2     : 1;
  unsigned char BLINK0      : 1;
  unsigned char BLINK1      : 1;
} __BITS_LCD_CR1;
#endif
__IO_REG8_BIT(LCD_CR1,     0x5400, __READ_WRITE, __BITS_LCD_CR1);

/* LCD control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char VSEL        : 1;
  unsigned char CC0         : 1;
  unsigned char CC1         : 1;
  unsigned char CC2         : 1;
  unsigned char HD          : 1;
  unsigned char PON0        : 1;
  unsigned char PON1        : 1;
  unsigned char PON2        : 1;
} __BITS_LCD_CR2;
#endif
__IO_REG8_BIT(LCD_CR2,     0x5401, __READ_WRITE, __BITS_LCD_CR2);

/* LCD control register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DEAD0       : 1;
  unsigned char DEAD1       : 1;
  unsigned char DEAD2       : 1;
  unsigned char SOFC        : 1;
  unsigned char SOF         : 1;
  unsigned char SOFIE       : 1;
  unsigned char LCDEN       : 1;
} __BITS_LCD_CR3;
#endif
__IO_REG8_BIT(LCD_CR3,     0x5402, __READ_WRITE, __BITS_LCD_CR3);

/* LCD frequency selection register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DIV0        : 1;
  unsigned char DIV1        : 1;
  unsigned char DIV2        : 1;
  unsigned char DIV3        : 1;
  unsigned char PS0         : 1;
  unsigned char PS1         : 1;
  unsigned char PS2         : 1;
  unsigned char PS3         : 1;
} __BITS_LCD_FRQ;
#endif
__IO_REG8_BIT(LCD_FRQ,     0x5403, __READ_WRITE, __BITS_LCD_FRQ);

/* LCD Port mask register 0 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SEG00       : 1;
  unsigned char SEG01       : 1;
  unsigned char SEG02       : 1;
  unsigned char SEG03       : 1;
  unsigned char SEG04       : 1;
  unsigned char SEG05       : 1;
  unsigned char SEG06       : 1;
} __BITS_LCD_PM0;
#endif
__IO_REG8_BIT(LCD_PM0,     0x5404, __READ_WRITE, __BITS_LCD_PM0);

/* LCD Port mask register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SEG08       : 1;
  unsigned char SEG09       : 1;
  unsigned char SEG10       : 1;
  unsigned char SEG11       : 1;
  unsigned char SEG12       : 1;
  unsigned char SEG13       : 1;
  unsigned char SEG14       : 1;
  unsigned char SEG07       : 1;
  unsigned char SEG15       : 1;
} __BITS_LCD_PM1;
#endif
__IO_REG8_BIT(LCD_PM1,     0x5405, __READ_WRITE, __BITS_LCD_PM1);

/* LCD Port mask register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SEG16       : 1;
  unsigned char SEG17       : 1;
  unsigned char SEG18       : 1;
  unsigned char SEG19       : 1;
  unsigned char SEG20       : 1;
  unsigned char SEG21       : 1;
  unsigned char SEG22       : 1;
  unsigned char SEG23       : 1;
} __BITS_LCD_PM2;
#endif
__IO_REG8_BIT(LCD_PM2,     0x5406, __READ_WRITE, __BITS_LCD_PM2);

/* LCD Port mask register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SEG24       : 1;
  unsigned char SEG25       : 1;
  unsigned char SEG26       : 1;
  unsigned char SEG27       : 1;
} __BITS_LCD_PM3;
#endif
__IO_REG8_BIT(LCD_PM3,     0x5407, __READ_WRITE, __BITS_LCD_PM3);

/* LCD display memory 0 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S000        : 1;
  unsigned char S001        : 1;
  unsigned char S002        : 1;
  unsigned char S003        : 1;
  unsigned char S004        : 1;
  unsigned char S005        : 1;
  unsigned char S006        : 1;
  unsigned char S007        : 1;
} __BITS_LCD_RAM0;
#endif
__IO_REG8_BIT(LCD_RAM0,    0x540C, __READ_WRITE, __BITS_LCD_RAM0);

/* LCD display memory 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S008        : 1;
  unsigned char S009        : 1;
  unsigned char S010        : 1;
  unsigned char S011        : 1;
  unsigned char S012        : 1;
  unsigned char S013        : 1;
  unsigned char S014        : 1;
  unsigned char S015        : 1;
} __BITS_LCD_RAM1;
#endif
__IO_REG8_BIT(LCD_RAM1,    0x540D, __READ_WRITE, __BITS_LCD_RAM1);

/* LCD display memory 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S016        : 1;
  unsigned char S017        : 1;
  unsigned char S018        : 1;
  unsigned char S019        : 1;
  unsigned char S020        : 1;
  unsigned char S021        : 1;
  unsigned char S022        : 1;
  unsigned char S023        : 1;
} __BITS_LCD_RAM2;
#endif
__IO_REG8_BIT(LCD_RAM2,    0x540E, __READ_WRITE, __BITS_LCD_RAM2);

/* LCD display memory 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S024        : 1;
  unsigned char S025        : 1;
  unsigned char S026        : 1;
  unsigned char S027        : 1;
  unsigned char S100        : 1;
  unsigned char S101        : 1;
  unsigned char S102        : 1;
  unsigned char S103        : 1;
} __BITS_LCD_RAM3;
#endif
__IO_REG8_BIT(LCD_RAM3,    0x540F, __READ_WRITE, __BITS_LCD_RAM3);

/* LCD display memory 4 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S104        : 1;
  unsigned char S105        : 1;
  unsigned char S106        : 1;
  unsigned char S107        : 1;
  unsigned char S108        : 1;
  unsigned char S109        : 1;
  unsigned char S110        : 1;
  unsigned char S111        : 1;
} __BITS_LCD_RAM4;
#endif
__IO_REG8_BIT(LCD_RAM4,    0x5410, __READ_WRITE, __BITS_LCD_RAM4);

/* LCD display memory 5 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S112        : 1;
  unsigned char S113        : 1;
  unsigned char S114        : 1;
  unsigned char S115        : 1;
  unsigned char S116        : 1;
  unsigned char S117        : 1;
  unsigned char S118        : 1;
  unsigned char S119        : 1;
} __BITS_LCD_RAM5;
#endif
__IO_REG8_BIT(LCD_RAM5,    0x5411, __READ_WRITE, __BITS_LCD_RAM5);

/* LCD display memory 6 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S120        : 1;
  unsigned char S121        : 1;
  unsigned char S122        : 1;
  unsigned char S123        : 1;
  unsigned char S124        : 1;
  unsigned char S125        : 1;
  unsigned char S126        : 1;
  unsigned char S127        : 1;
} __BITS_LCD_RAM6;
#endif
__IO_REG8_BIT(LCD_RAM6,    0x5412, __READ_WRITE, __BITS_LCD_RAM6);

/* LCD display memory 7 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S200        : 1;
  unsigned char S201        : 1;
  unsigned char S202        : 1;
  unsigned char S203        : 1;
  unsigned char S204        : 1;
  unsigned char S205        : 1;
  unsigned char S206        : 1;
  unsigned char S207        : 1;
} __BITS_LCD_RAM7;
#endif
__IO_REG8_BIT(LCD_RAM7,    0x5413, __READ_WRITE, __BITS_LCD_RAM7);

