yazimma/GH_Terra/SW/STM8L15x-16x-05x-AL31-L_StdPeriph_Lib_V1.6.1/iostm8l152c6.h
/* LCD display memory 8 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S208        : 1;
  unsigned char S209        : 1;
  unsigned char S210        : 1;
  unsigned char S211        : 1;
  unsigned char S212        : 1;
  unsigned char S213        : 1;
  unsigned char S214        : 1;
  unsigned char S215        : 1;
} __BITS_LCD_RAM8;
#endif
__IO_REG8_BIT(LCD_RAM8,    0x5414, __READ_WRITE, __BITS_LCD_RAM8);

/* LCD display memory 9 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S216        : 1;
  unsigned char S217        : 1;
  unsigned char S218        : 1;
  unsigned char S219        : 1;
  unsigned char S220        : 1;
  unsigned char S221        : 1;
  unsigned char S222        : 1;
  unsigned char S223        : 1;
} __BITS_LCD_RAM9;
#endif
__IO_REG8_BIT(LCD_RAM9,    0x5415, __READ_WRITE, __BITS_LCD_RAM9);

/* LCD display memory 10 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S224        : 1;
  unsigned char S225        : 1;
  unsigned char S226        : 1;
  unsigned char S227        : 1;
  unsigned char S300        : 1;
  unsigned char S301        : 1;
  unsigned char S302        : 1;
  unsigned char S303        : 1;
} __BITS_LCD_RAM10;
#endif
__IO_REG8_BIT(LCD_RAM10,   0x5416, __READ_WRITE, __BITS_LCD_RAM10);

/* LCD display memory 11 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S304        : 1;
  unsigned char S305        : 1;
  unsigned char S306        : 1;
  unsigned char S307        : 1;
  unsigned char S308        : 1;
  unsigned char S309        : 1;
  unsigned char S310        : 1;
  unsigned char S311        : 1;
} __BITS_LCD_RAM11;
#endif
__IO_REG8_BIT(LCD_RAM11,   0x5417, __READ_WRITE, __BITS_LCD_RAM11);

/* LCD display memory 12 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S312        : 1;
  unsigned char S313        : 1;
  unsigned char S314        : 1;
  unsigned char S315        : 1;
  unsigned char S316        : 1;
  unsigned char S317        : 1;
  unsigned char S318        : 1;
  unsigned char S319        : 1;
} __BITS_LCD_RAM12;
#endif
__IO_REG8_BIT(LCD_RAM12,   0x5418, __READ_WRITE, __BITS_LCD_RAM12);

/* LCD display memory 13 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char S320        : 1;
  unsigned char S321        : 1;
  unsigned char S322        : 1;
  unsigned char S323        : 1;
  unsigned char S324        : 1;
  unsigned char S325        : 1;
  unsigned char S326        : 1;
  unsigned char S327        : 1;
} __BITS_LCD_RAM13;
#endif
__IO_REG8_BIT(LCD_RAM13,   0x5419, __READ_WRITE, __BITS_LCD_RAM13);


/*-------------------------------------------------------------------------
 *      LCD bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define LCD_CR1_B2               LCD_CR1_bit.B2
#define LCD_CR1_DUTY0            LCD_CR1_bit.DUTY0
#define LCD_CR1_DUTY1            LCD_CR1_bit.DUTY1
#define LCD_CR1_BLINKF0          LCD_CR1_bit.BLINKF0
#define LCD_CR1_BLINKF1          LCD_CR1_bit.BLINKF1
#define LCD_CR1_BLINKF2          LCD_CR1_bit.BLINKF2
#define LCD_CR1_BLINK0           LCD_CR1_bit.BLINK0
#define LCD_CR1_BLINK1           LCD_CR1_bit.BLINK1

#define LCD_CR2_VSEL             LCD_CR2_bit.VSEL
#define LCD_CR2_CC0              LCD_CR2_bit.CC0
#define LCD_CR2_CC1              LCD_CR2_bit.CC1
#define LCD_CR2_CC2              LCD_CR2_bit.CC2
#define LCD_CR2_HD               LCD_CR2_bit.HD
#define LCD_CR2_PON0             LCD_CR2_bit.PON0
#define LCD_CR2_PON1             LCD_CR2_bit.PON1
#define LCD_CR2_PON2             LCD_CR2_bit.PON2

#define LCD_CR3_DEAD0            LCD_CR3_bit.DEAD0
#define LCD_CR3_DEAD1            LCD_CR3_bit.DEAD1
#define LCD_CR3_DEAD2            LCD_CR3_bit.DEAD2
#define LCD_CR3_SOFC             LCD_CR3_bit.SOFC
#define LCD_CR3_SOF              LCD_CR3_bit.SOF
#define LCD_CR3_SOFIE            LCD_CR3_bit.SOFIE
#define LCD_CR3_LCDEN            LCD_CR3_bit.LCDEN

#define LCD_FRQ_DIV0             LCD_FRQ_bit.DIV0
#define LCD_FRQ_DIV1             LCD_FRQ_bit.DIV1
#define LCD_FRQ_DIV2             LCD_FRQ_bit.DIV2
#define LCD_FRQ_DIV3             LCD_FRQ_bit.DIV3
#define LCD_FRQ_PS0              LCD_FRQ_bit.PS0
#define LCD_FRQ_PS1              LCD_FRQ_bit.PS1
#define LCD_FRQ_PS2              LCD_FRQ_bit.PS2
#define LCD_FRQ_PS3              LCD_FRQ_bit.PS3

#define LCD_PM0_SEG00            LCD_PM0_bit.SEG00
#define LCD_PM0_SEG01            LCD_PM0_bit.SEG01
#define LCD_PM0_SEG02            LCD_PM0_bit.SEG02
#define LCD_PM0_SEG03            LCD_PM0_bit.SEG03
#define LCD_PM0_SEG04            LCD_PM0_bit.SEG04
#define LCD_PM0_SEG05            LCD_PM0_bit.SEG05
#define LCD_PM0_SEG06            LCD_PM0_bit.SEG06

#define LCD_PM1_SEG08            LCD_PM1_bit.SEG08
#define LCD_PM1_SEG09            LCD_PM1_bit.SEG09
#define LCD_PM1_SEG10            LCD_PM1_bit.SEG10
#define LCD_PM1_SEG11            LCD_PM1_bit.SEG11
#define LCD_PM1_SEG12            LCD_PM1_bit.SEG12
#define LCD_PM1_SEG13            LCD_PM1_bit.SEG13
#define LCD_PM1_SEG14            LCD_PM1_bit.SEG14
#define LCD_PM1_SEG07            LCD_PM1_bit.SEG07
#define LCD_PM1_SEG15            LCD_PM1_bit.SEG15

#define LCD_PM2_SEG16            LCD_PM2_bit.SEG16
#define LCD_PM2_SEG17            LCD_PM2_bit.SEG17
#define LCD_PM2_SEG18            LCD_PM2_bit.SEG18
#define LCD_PM2_SEG19            LCD_PM2_bit.SEG19
#define LCD_PM2_SEG20            LCD_PM2_bit.SEG20
#define LCD_PM2_SEG21            LCD_PM2_bit.SEG21
#define LCD_PM2_SEG22            LCD_PM2_bit.SEG22
#define LCD_PM2_SEG23            LCD_PM2_bit.SEG23

#define LCD_PM3_SEG24            LCD_PM3_bit.SEG24
#define LCD_PM3_SEG25            LCD_PM3_bit.SEG25
#define LCD_PM3_SEG26            LCD_PM3_bit.SEG26
#define LCD_PM3_SEG27            LCD_PM3_bit.SEG27

#define LCD_RAM0_S000            LCD_RAM0_bit.S000
#define LCD_RAM0_S001            LCD_RAM0_bit.S001
#define LCD_RAM0_S002            LCD_RAM0_bit.S002
#define LCD_RAM0_S003            LCD_RAM0_bit.S003
#define LCD_RAM0_S004            LCD_RAM0_bit.S004
#define LCD_RAM0_S005            LCD_RAM0_bit.S005
#define LCD_RAM0_S006            LCD_RAM0_bit.S006
#define LCD_RAM0_S007            LCD_RAM0_bit.S007

#define LCD_RAM1_S008            LCD_RAM1_bit.S008
#define LCD_RAM1_S009            LCD_RAM1_bit.S009
#define LCD_RAM1_S010            LCD_RAM1_bit.S010
#define LCD_RAM1_S011            LCD_RAM1_bit.S011
#define LCD_RAM1_S012            LCD_RAM1_bit.S012
#define LCD_RAM1_S013            LCD_RAM1_bit.S013
#define LCD_RAM1_S014            LCD_RAM1_bit.S014
#define LCD_RAM1_S015            LCD_RAM1_bit.S015

#define LCD_RAM2_S016            LCD_RAM2_bit.S016
#define LCD_RAM2_S017            LCD_RAM2_bit.S017
#define LCD_RAM2_S018            LCD_RAM2_bit.S018
#define LCD_RAM2_S019            LCD_RAM2_bit.S019
#define LCD_RAM2_S020            LCD_RAM2_bit.S020
#define LCD_RAM2_S021            LCD_RAM2_bit.S021
#define LCD_RAM2_S022            LCD_RAM2_bit.S022
#define LCD_RAM2_S023            LCD_RAM2_bit.S023

#define LCD_RAM3_S024            LCD_RAM3_bit.S024
#define LCD_RAM3_S025            LCD_RAM3_bit.S025
#define LCD_RAM3_S026            LCD_RAM3_bit.S026
#define LCD_RAM3_S027            LCD_RAM3_bit.S027
#define LCD_RAM3_S100            LCD_RAM3_bit.S100
#define LCD_RAM3_S101            LCD_RAM3_bit.S101
#define LCD_RAM3_S102            LCD_RAM3_bit.S102
#define LCD_RAM3_S103            LCD_RAM3_bit.S103

#define LCD_RAM4_S104            LCD_RAM4_bit.S104
#define LCD_RAM4_S105            LCD_RAM4_bit.S105
#define LCD_RAM4_S106            LCD_RAM4_bit.S106
#define LCD_RAM4_S107            LCD_RAM4_bit.S107
#define LCD_RAM4_S108            LCD_RAM4_bit.S108
#define LCD_RAM4_S109            LCD_RAM4_bit.S109
#define LCD_RAM4_S110            LCD_RAM4_bit.S110
#define LCD_RAM4_S111            LCD_RAM4_bit.S111

#define LCD_RAM5_S112            LCD_RAM5_bit.S112
#define LCD_RAM5_S113            LCD_RAM5_bit.S113
#define LCD_RAM5_S114            LCD_RAM5_bit.S114
#define LCD_RAM5_S115            LCD_RAM5_bit.S115
#define LCD_RAM5_S116            LCD_RAM5_bit.S116
#define LCD_RAM5_S117            LCD_RAM5_bit.S117
#define LCD_RAM5_S118            LCD_RAM5_bit.S118
#define LCD_RAM5_S119            LCD_RAM5_bit.S119

#define LCD_RAM6_S120            LCD_RAM6_bit.S120
#define LCD_RAM6_S121            LCD_RAM6_bit.S121
#define LCD_RAM6_S122            LCD_RAM6_bit.S122
#define LCD_RAM6_S123            LCD_RAM6_bit.S123
#define LCD_RAM6_S124            LCD_RAM6_bit.S124
#define LCD_RAM6_S125            LCD_RAM6_bit.S125
#define LCD_RAM6_S126            LCD_RAM6_bit.S126
#define LCD_RAM6_S127            LCD_RAM6_bit.S127

#define LCD_RAM7_S200            LCD_RAM7_bit.S200
#define LCD_RAM7_S201            LCD_RAM7_bit.S201
#define LCD_RAM7_S202            LCD_RAM7_bit.S202
#define LCD_RAM7_S203            LCD_RAM7_bit.S203
#define LCD_RAM7_S204            LCD_RAM7_bit.S204
#define LCD_RAM7_S205            LCD_RAM7_bit.S205
#define LCD_RAM7_S206            LCD_RAM7_bit.S206
#define LCD_RAM7_S207            LCD_RAM7_bit.S207

#define LCD_RAM8_S208            LCD_RAM8_bit.S208
#define LCD_RAM8_S209            LCD_RAM8_bit.S209
#define LCD_RAM8_S210            LCD_RAM8_bit.S210
#define LCD_RAM8_S211            LCD_RAM8_bit.S211
#define LCD_RAM8_S212            LCD_RAM8_bit.S212
#define LCD_RAM8_S213            LCD_RAM8_bit.S213
#define LCD_RAM8_S214            LCD_RAM8_bit.S214
#define LCD_RAM8_S215            LCD_RAM8_bit.S215

#define LCD_RAM9_S216            LCD_RAM9_bit.S216
#define LCD_RAM9_S217            LCD_RAM9_bit.S217
#define LCD_RAM9_S218            LCD_RAM9_bit.S218
#define LCD_RAM9_S219            LCD_RAM9_bit.S219
#define LCD_RAM9_S220            LCD_RAM9_bit.S220
#define LCD_RAM9_S221            LCD_RAM9_bit.S221
#define LCD_RAM9_S222            LCD_RAM9_bit.S222
#define LCD_RAM9_S223            LCD_RAM9_bit.S223

#define LCD_RAM10_S224           LCD_RAM10_bit.S224
#define LCD_RAM10_S225           LCD_RAM10_bit.S225
#define LCD_RAM10_S226           LCD_RAM10_bit.S226
#define LCD_RAM10_S227           LCD_RAM10_bit.S227
#define LCD_RAM10_S300           LCD_RAM10_bit.S300
#define LCD_RAM10_S301           LCD_RAM10_bit.S301
#define LCD_RAM10_S302           LCD_RAM10_bit.S302
#define LCD_RAM10_S303           LCD_RAM10_bit.S303

