yazimma/GH_Terra/SW/STM8L15x-16x-05x-AL31-L_StdPeriph_Lib_V1.6.1/iostm8l152c6.h
#define LCD_RAM11_S304           LCD_RAM11_bit.S304
#define LCD_RAM11_S305           LCD_RAM11_bit.S305
#define LCD_RAM11_S306           LCD_RAM11_bit.S306
#define LCD_RAM11_S307           LCD_RAM11_bit.S307
#define LCD_RAM11_S308           LCD_RAM11_bit.S308
#define LCD_RAM11_S309           LCD_RAM11_bit.S309
#define LCD_RAM11_S310           LCD_RAM11_bit.S310
#define LCD_RAM11_S311           LCD_RAM11_bit.S311

#define LCD_RAM12_S312           LCD_RAM12_bit.S312
#define LCD_RAM12_S313           LCD_RAM12_bit.S313
#define LCD_RAM12_S314           LCD_RAM12_bit.S314
#define LCD_RAM12_S315           LCD_RAM12_bit.S315
#define LCD_RAM12_S316           LCD_RAM12_bit.S316
#define LCD_RAM12_S317           LCD_RAM12_bit.S317
#define LCD_RAM12_S318           LCD_RAM12_bit.S318
#define LCD_RAM12_S319           LCD_RAM12_bit.S319

#define LCD_RAM13_S320           LCD_RAM13_bit.S320
#define LCD_RAM13_S321           LCD_RAM13_bit.S321
#define LCD_RAM13_S322           LCD_RAM13_bit.S322
#define LCD_RAM13_S323           LCD_RAM13_bit.S323
#define LCD_RAM13_S324           LCD_RAM13_bit.S324
#define LCD_RAM13_S325           LCD_RAM13_bit.S325
#define LCD_RAM13_S326           LCD_RAM13_bit.S326
#define LCD_RAM13_S327           LCD_RAM13_bit.S327

#endif

/*-------------------------------------------------------------------------
 *      LCD bit masks
 *-----------------------------------------------------------------------*/
#define MASK_LCD_CR1_B2          0x01
#define MASK_LCD_CR1_DUTY0       0x02
#define MASK_LCD_CR1_DUTY1       0x04
#define MASK_LCD_CR1_BLINKF0     0x08
#define MASK_LCD_CR1_BLINKF1     0x10
#define MASK_LCD_CR1_BLINKF2     0x20
#define MASK_LCD_CR1_BLINK0      0x40
#define MASK_LCD_CR1_BLINK1      0x80

#define MASK_LCD_CR2_VSEL        0x01
#define MASK_LCD_CR2_CC0         0x02
#define MASK_LCD_CR2_CC1         0x04
#define MASK_LCD_CR2_CC2         0x08
#define MASK_LCD_CR2_HD          0x10
#define MASK_LCD_CR2_PON0        0x20
#define MASK_LCD_CR2_PON1        0x40
#define MASK_LCD_CR2_PON2        0x80

#define MASK_LCD_CR3_DEAD0       0x01
#define MASK_LCD_CR3_DEAD1       0x02
#define MASK_LCD_CR3_DEAD2       0x04
#define MASK_LCD_CR3_SOFC        0x08
#define MASK_LCD_CR3_SOF         0x10
#define MASK_LCD_CR3_SOFIE       0x20
#define MASK_LCD_CR3_LCDEN       0x40

#define MASK_LCD_FRQ_DIV0        0x01
#define MASK_LCD_FRQ_DIV1        0x02
#define MASK_LCD_FRQ_DIV2        0x04
#define MASK_LCD_FRQ_DIV3        0x08
#define MASK_LCD_FRQ_PS0         0x10
#define MASK_LCD_FRQ_PS1         0x20
#define MASK_LCD_FRQ_PS2         0x40
#define MASK_LCD_FRQ_PS3         0x80

#define MASK_LCD_PM0_SEG00       0x01
#define MASK_LCD_PM0_SEG01       0x02
#define MASK_LCD_PM0_SEG02       0x04
#define MASK_LCD_PM0_SEG03       0x08
#define MASK_LCD_PM0_SEG04       0x10
#define MASK_LCD_PM0_SEG05       0x20
#define MASK_LCD_PM0_SEG06       0x40

#define MASK_LCD_PM1_SEG08       0x01
#define MASK_LCD_PM1_SEG09       0x02
#define MASK_LCD_PM1_SEG10       0x04
#define MASK_LCD_PM1_SEG11       0x08
#define MASK_LCD_PM1_SEG12       0x10
#define MASK_LCD_PM1_SEG13       0x20
#define MASK_LCD_PM1_SEG14       0x40
#define MASK_LCD_PM1_SEG07       0x80
#define MASK_LCD_PM1_SEG15       0x80

#define MASK_LCD_PM2_SEG16       0x01
#define MASK_LCD_PM2_SEG17       0x02
#define MASK_LCD_PM2_SEG18       0x04
#define MASK_LCD_PM2_SEG19       0x08
#define MASK_LCD_PM2_SEG20       0x10
#define MASK_LCD_PM2_SEG21       0x20
#define MASK_LCD_PM2_SEG22       0x40
#define MASK_LCD_PM2_SEG23       0x80

#define MASK_LCD_PM3_SEG24       0x01
#define MASK_LCD_PM3_SEG25       0x02
#define MASK_LCD_PM3_SEG26       0x04
#define MASK_LCD_PM3_SEG27       0x08

#define MASK_LCD_RAM0_S000       0x01
#define MASK_LCD_RAM0_S001       0x02
#define MASK_LCD_RAM0_S002       0x04
#define MASK_LCD_RAM0_S003       0x08
#define MASK_LCD_RAM0_S004       0x10
#define MASK_LCD_RAM0_S005       0x20
#define MASK_LCD_RAM0_S006       0x40
#define MASK_LCD_RAM0_S007       0x80

#define MASK_LCD_RAM1_S008       0x01
#define MASK_LCD_RAM1_S009       0x02
#define MASK_LCD_RAM1_S010       0x04
#define MASK_LCD_RAM1_S011       0x08
#define MASK_LCD_RAM1_S012       0x10
#define MASK_LCD_RAM1_S013       0x20
#define MASK_LCD_RAM1_S014       0x40
#define MASK_LCD_RAM1_S015       0x80

#define MASK_LCD_RAM2_S016       0x01
#define MASK_LCD_RAM2_S017       0x02
#define MASK_LCD_RAM2_S018       0x04
#define MASK_LCD_RAM2_S019       0x08
#define MASK_LCD_RAM2_S020       0x10
#define MASK_LCD_RAM2_S021       0x20
#define MASK_LCD_RAM2_S022       0x40
#define MASK_LCD_RAM2_S023       0x80

#define MASK_LCD_RAM3_S024       0x01
#define MASK_LCD_RAM3_S025       0x02
#define MASK_LCD_RAM3_S026       0x04
#define MASK_LCD_RAM3_S027       0x08
#define MASK_LCD_RAM3_S100       0x10
#define MASK_LCD_RAM3_S101       0x20
#define MASK_LCD_RAM3_S102       0x40
#define MASK_LCD_RAM3_S103       0x80

#define MASK_LCD_RAM4_S104       0x01
#define MASK_LCD_RAM4_S105       0x02
#define MASK_LCD_RAM4_S106       0x04
#define MASK_LCD_RAM4_S107       0x08
#define MASK_LCD_RAM4_S108       0x10
#define MASK_LCD_RAM4_S109       0x20
#define MASK_LCD_RAM4_S110       0x40
#define MASK_LCD_RAM4_S111       0x80

#define MASK_LCD_RAM5_S112       0x01
#define MASK_LCD_RAM5_S113       0x02
#define MASK_LCD_RAM5_S114       0x04
#define MASK_LCD_RAM5_S115       0x08
#define MASK_LCD_RAM5_S116       0x10
#define MASK_LCD_RAM5_S117       0x20
#define MASK_LCD_RAM5_S118       0x40
#define MASK_LCD_RAM5_S119       0x80

#define MASK_LCD_RAM6_S120       0x01
#define MASK_LCD_RAM6_S121       0x02
#define MASK_LCD_RAM6_S122       0x04
#define MASK_LCD_RAM6_S123       0x08
#define MASK_LCD_RAM6_S124       0x10
#define MASK_LCD_RAM6_S125       0x20
#define MASK_LCD_RAM6_S126       0x40
#define MASK_LCD_RAM6_S127       0x80

#define MASK_LCD_RAM7_S200       0x01
#define MASK_LCD_RAM7_S201       0x02
#define MASK_LCD_RAM7_S202       0x04
#define MASK_LCD_RAM7_S203       0x08
#define MASK_LCD_RAM7_S204       0x10
#define MASK_LCD_RAM7_S205       0x20
#define MASK_LCD_RAM7_S206       0x40
#define MASK_LCD_RAM7_S207       0x80

#define MASK_LCD_RAM8_S208       0x01
#define MASK_LCD_RAM8_S209       0x02
#define MASK_LCD_RAM8_S210       0x04
#define MASK_LCD_RAM8_S211       0x08
#define MASK_LCD_RAM8_S212       0x10
#define MASK_LCD_RAM8_S213       0x20
#define MASK_LCD_RAM8_S214       0x40
#define MASK_LCD_RAM8_S215       0x80

#define MASK_LCD_RAM9_S216       0x01
#define MASK_LCD_RAM9_S217       0x02
#define MASK_LCD_RAM9_S218       0x04
#define MASK_LCD_RAM9_S219       0x08
#define MASK_LCD_RAM9_S220       0x10
#define MASK_LCD_RAM9_S221       0x20
#define MASK_LCD_RAM9_S222       0x40
#define MASK_LCD_RAM9_S223       0x80

#define MASK_LCD_RAM10_S224      0x01
#define MASK_LCD_RAM10_S225      0x02
#define MASK_LCD_RAM10_S226      0x04
#define MASK_LCD_RAM10_S227      0x08
#define MASK_LCD_RAM10_S300      0x10
#define MASK_LCD_RAM10_S301      0x20
#define MASK_LCD_RAM10_S302      0x40
#define MASK_LCD_RAM10_S303      0x80

