yazimma/GH_Terra/SW/STM8L15x-16x-05x-AL31-L_StdPeriph_Lib_V1.6.1/iostm8l152c6.h
#define MASK_ITC_SPR5_VECT16SPR  0x03
#define MASK_ITC_SPR5_VECT17SPR  0x0C
#define MASK_ITC_SPR5_VECT18SPR  0x30
#define MASK_ITC_SPR5_VECT19SPR  0xC0

#define MASK_ITC_SPR6_VECT20SPR  0x03
#define MASK_ITC_SPR6_VECT21SPR  0x0C
#define MASK_ITC_SPR6_VECT22SPR  0x30
#define MASK_ITC_SPR6_VECT23SPR  0xC0

#define MASK_ITC_SPR7_VECT24SPR  0x03
#define MASK_ITC_SPR7_VECT25SPR  0x0C
#define MASK_ITC_SPR7_VECT26SPR  0x30
#define MASK_ITC_SPR7_VECT27SPR  0xC0

#define MASK_ITC_SPR8_VECT28SPR  0x03
#define MASK_ITC_SPR8_VECT29SPR  0x0C


/*-------------------------------------------------------------------------
 *      SWIM register definitions
 *-----------------------------------------------------------------------*/
/* SWIM control status register */
__IO_REG8    (SWIM_CSR,    0x7F80, __READ_WRITE);


/*-------------------------------------------------------------------------
 *      DM register definitions
 *-----------------------------------------------------------------------*/
/* DM breakpoint 1 register extended byte */
__IO_REG8    (DM_BK1RE,    0x7F90, __READ_WRITE);
/* DM breakpoint 1 register high byte */
__IO_REG8    (DM_BK1RH,    0x7F91, __READ_WRITE);
/* DM breakpoint 1 register low byte */
__IO_REG8    (DM_BK1RL,    0x7F92, __READ_WRITE);
/* DM breakpoint 2 register extended byte */
__IO_REG8    (DM_BK2RE,    0x7F93, __READ_WRITE);
/* DM breakpoint 2 register high byte */
__IO_REG8    (DM_BK2RH,    0x7F94, __READ_WRITE);
/* DM breakpoint 2 register low byte */
__IO_REG8    (DM_BK2RL,    0x7F95, __READ_WRITE);
/* DM Debug module control register 1 */
__IO_REG8    (DM_CR1,      0x7F96, __READ_WRITE);
/* DM Debug module control register 2 */
__IO_REG8    (DM_CR2,      0x7F97, __READ_WRITE);
/* DM Debug module control/status register 1 */
__IO_REG8    (DM_CSR1,     0x7F98, __READ_WRITE);
/* DM Debug module control/status register 2 */
__IO_REG8    (DM_CSR2,     0x7F99, __READ_WRITE);
/* DM enable function register */
__IO_REG8    (DM_ENFCTR,   0x7F9A, __READ_WRITE);


/*-------------------------------------------------------------------------
 *      Interrupt vector numbers
 *-----------------------------------------------------------------------*/
#define FLASH_EOP_vector                     0x03
#define FLASH_WR_PG_DIS_vector               0x03
#define DMA1_CH0_HT_vector                   0x04
#define DMA1_CH0_TC_vector                   0x04
#define DMA1_CH1_HT_vector                   0x04
#define DMA1_CH1_TC_vector                   0x04
#define DMA1_CH2_HT_vector                   0x05
#define DMA1_CH2_TC_vector                   0x05
#define DMA1_CH3_HT_vector                   0x05
#define DMA1_CH3_TC_vector                   0x05
#define RTC_ALARM_vector                     0x06
#define RTC_WAKEUP_vector                    0x06
#define EXTIE_vector                         0x07
#define EXTIF_vector                         0x07
#define EXTIPVD_vector                       0x07
#define EXTIB_vector                         0x08
#define EXTID_vector                         0x09
#define EXTI0_vector                         0x0A
#define EXTI1_vector                         0x0B
#define EXTI2_vector                         0x0C
#define EXTI3_vector                         0x0D
#define EXTI4_vector                         0x0E
#define EXTI5_vector                         0x0F
#define EXTI6_vector                         0x10
#define EXTI7_vector                         0x11
#define LCD_SOF_vector                       0x12
#define CLK_CSS_vector                       0x13
#define CLK_SWITCH_vector                    0x13
#define TIM1_BIF_vector                      0x13
#define COMP_EF2_vector                      0x14
#define COMP_EF1_vector                      0x14
#define TIM2_OVR_UIF_vector                  0x15
#define TIM2_CAPCOM_BIF_vector               0x16
#define TIM2_CAPCOM_TIF_vector               0x16
#define TIM2_CAPCOM_CC2IF_vector             0x16
#define TIM2_CAPCOM_CC1IF_vector             0x16
#define TIM3_OVR_UIF_vector                  0x17
#define TIM3_CAPCOM_BIF_vector               0x18
#define TIM3_CAPCOM_TIF_vector               0x18
#define TIM3_CAPCOM_CC2IF_vector             0x18
#define TIM3_CAPCOM_CC1IF_vector             0x18
#define TIM1_OVR_UIF_vector                  0x19
#define TIM1_CAPCOM_TIF_vector               0x1A
#define TIM1_CAPCOM_CC4IF_vector             0x1A
#define TIM1_CAPCOM_CC3IF_vector             0x1A
#define TIM1_CAPCOM_CC2IF_vector             0x1A
#define TIM1_CAPCOM_CC1IF_vector             0x1A
#define TIM1_CAPCOM_COMIF_vector             0x1A
#define TIM4_TIF_vector                      0x1B
#define TIM4_UIF_vector                      0x1B
#define SPI_TXE_vector                       0x1C
#define SPI_RXNE_vector                      0x1C
#define SPI_WKUP_vector                      0x1C
#define SPI_MODF_vector                      0x1C
#define SPI_OVR_vector                       0x1C
#define USART_T_TXE_vector                   0x1D
#define USART_T_TC_vector                    0x1D
#define USART_R_RXNE_vector                  0x1E
#define USART_R_OR_vector                    0x1E
#define USART_R_IDLE_vector                  0x1E
#define USART_R_PE_vector                    0x1E
#define I2C_SB_vector                        0x1F
#define I2C_ADDR_vector                      0x1F
#define I2C_ADD10_vector                     0x1F
#define I2C_STOPF_vector                     0x1F
#define I2C_BTF_vector                       0x1F
#define I2C_WUFH_vector                      0x1F
#define I2C_RXNE_vector                      0x1F
#define I2C_TXE_vector                       0x1F
#define I2C_BERR_vector                      0x1F
#define I2C_ARLO_vector                      0x1F
#define I2C_AF_vector                        0x1F
#define I2C_OVR_vector                       0x1F

#ifdef __IAR_SYSTEMS_ICC__
#pragma language=restore
#endif

#endif    /* __IOSTM8L152C6_H__ */

/*----------------------------------------------
 *      End of file
 *--------------------------------------------*/
